# Getting and Knowing DATA

In [2]:
import pandas as pd
import numpy as np

### Step 1: Import Dataset

In [15]:
df = pd.read_csv("chipotle.tsv", sep = "\t")
df.head(5)

,order_id,quantity,item_name,choice_description,item_price
0,1,1,Chips and Fresh Tomato Salsa,NaN,$2.39
1,1,1,Izze,[Clementine],$3.39
2,1,1,Nantucket Nectar,[Apple],$3.39
3,1,1,Chips and Tomatillo-Green Chili Salsa,NaN,$2.39
4,2,2,Chicken Bowl,"[Tomatillo-Red Chili Salsa (Hot), [Black Beans...",$16.98

### STEP 2: Dataset overview

In [12]:
df.shape

(4622, 5)

In [17]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 4622 entries, 0 to 4621
Data columns (total 5 columns):
 #   Column              Non-Null Count  Dtype
---  ------              --------------  -----
 0   order_id            4622 non-null   int64
 1   quantity            4622 non-null   int64
 2   item_name           4622 non-null   object
 3   choice_description  3376 non-null   object
 4   item_price          4622 non-null   object
dtypes: int64(2), object(3)
memory usage: 180.7+ KB

In [21]:
# print all collumns name 
list(df.columns)

['order_id', 'quantity', 'item_name', 'choice_description', 'item_price']

In [22]:
# print index of all columns
df.index

RangeIndex(start=0, stop=4622, step=1)

In [28]:
# statistical all type of data
'''
count : so lan xuat hien 
mean : trung binh 
std : do lech chuan 
min, max 
quartile: tu phan vi 
'''
df.describe() # chỉ tính các phần tử số liệu

          order_id     quantity
count  4622.000000  4622.000000
mean    927.254868     1.075725
std     528.890796     0.410186
min       1.000000     1.000000
25%     477.250000     1.000000
50%     926.000000     1.000000
75%    1393.000000     1.000000
max    1834.000000    15.000000

In [29]:
df.describe(include = "all") # all data

           order_id     quantity     item_name choice_description item_price
count   4622.000000  4622.000000          4622               3376       4622
unique          NaN          NaN            50               1043         78
top             NaN          NaN  Chicken Bowl        [Diet Coke]     $8.75
freq            NaN          NaN           726                134        730
mean     927.254868     1.075725           NaN                NaN        NaN
std      528.890796     0.410186           NaN                NaN        NaN
min        1.000000     1.000000           NaN                NaN        NaN
25%      477.250000     1.000000           NaN                NaN        NaN
50%      926.000000     1.000000           NaN                NaN        NaN
75%     1393.000000     1.000000           NaN                NaN        NaN
max     1834.000000    15.000000           NaN                NaN        NaN

### loc vs iloc

In [30]:
df.head()

,order_id,quantity,item_name,choice_description,item_price
0,1,1,Chips and Fresh Tomato Salsa,NaN,$2.39
1,1,1,Izze,[Clementine],$3.39
2,1,1,Nantucket Nectar,[Apple],$3.39
3,1,1,Chips and Tomatillo-Green Chili Salsa,NaN,$2.39
4,2,2,Chicken Bowl,"[Tomatillo-Red Chili Salsa (Hot), [Black Beans...",$16.98

In [44]:
#select rows with multiple conditions 
df.loc[(df.quantity == 15) | (df.item_name == "Izze") , ["quantity", "order_id", "item_price"]]

      quantity  order_id item_price
1            1         1     $3.39
24           1        12     $3.39
47           1        21     $3.39
66           1        30     $3.39
359          1       155     $3.39
360          1       155     $3.39
430          1       186     $3.39
579          1       237     $3.39
580          1       237     $3.39
1059         1       436     $3.39
1213         1       495     $3.39
1611         1       651     $3.39
1612         1       651     $3.39
1680         1       680     $3.39
2088         1       842     $3.39
2619         1      1040     $3.39
2634         1      1046     $3.39
2758         1      1095     $3.39
2891         1      1149     $3.39
3598        15      1443    $44.25
3669         1      1468     $3.39

In [50]:
df.loc[(df.quantity == 3) & (df.item_name == "Chicken Bowl") ]

,order_id,quantity,item_name,choice_description,item_price
409,178,3,Chicken Bowl,"[[Fresh Tomato Salsa (Mild), Tomatillo-Green C...",$32.94
1514,616,3,Chicken Bowl,"[Fresh Tomato Salsa, [Rice, Black Beans, Chees...",$26.25

In [59]:
# check data in row n 

print(type(df.iloc[1]))
df.iloc[[409]]

<class 'pandas.core.series.Series'>

,order_id,quantity,item_name,choice_description,item_price
409,178,3,Chicken Bowl,"[[Fresh Tomato Salsa (Mild), Tomatillo-Green C...",$32.94

In [61]:
import pandas as pd

# %%
# 1. Tạo SERIES (Giống như tạo 1 cột danh sách món ăn)
# index là số thứ tự (0, 1, 2) mặc định
cot_mon_an = pd.Series(["Cơm", "Phở", "Bún"]) 
print("--- ĐÂY LÀ SERIES ---")
print(cot_mon_an)
print(type(cot_mon_an)) # Kết quả: pandas.core.series.Series

# %%
# 2. Tạo DATAFRAME (Giống như tạo cả menu)
# Dùng Dictionary để tạo: Khóa là tên cột, Giá trị là List
data = {
    "Tên Món": ["Cơm", "Phở", "Bún"],
    "Giá Tiền": [30 , 40, 35]
}
menu = pd.DataFrame(data)

print("\n--- ĐÂY LÀ DATAFRAME ---")
print(menu)
print(type(menu)) # Kết quả: pandas.core.frame.DataFrame

# %%
# 3. THỬ NGHIỆM: Lôi 1 cột từ DataFrame ra
cot_lay_ra = menu["Tên Món"]
print("\n--- Cột lấy ra từ DataFrame chính là Series ---")
print(type(cot_lay_ra)) # Mày sẽ thấy nó trả về Series

--- ĐÂY LÀ SERIES ---
0    Cơm
1    Phở
2    Bún
dtype: object
<class 'pandas.core.series.Series'>

--- ĐÂY LÀ DATAFRAME ---
  Tên Món  Giá Tiền
0     Cơm        30
1     Phở        40
2     Bún        35
<class 'pandas.core.frame.DataFrame'>

--- Cột lấy ra từ DataFrame chính là Series ---
<class 'pandas.core.series.Series'>

In [63]:
# df.iloc[start : stop (rows) , start : stop (columns))]
df.iloc[3:5]

,order_id,quantity,item_name,choice_description,item_price
3,1,1,Chips and Tomatillo-Green Chili Salsa,NaN,$2.39
4,2,2,Chicken Bowl,"[Tomatillo-Red Chili Salsa (Hot), [Black Beans...",$16.98

In [64]:
df.iloc[2:5 , 1:-1]

,quantity,item_name,choice_description
2,1,Nantucket Nectar,[Apple]
3,1,Chips and Tomatillo-Green Chili Salsa,NaN
4,2,Chicken Bowl,"[Tomatillo-Red Chili Salsa (Hot), [Black Beans..."

### Data Manipulation

In [65]:
df.item_price.dtype

dtype('O')

In [69]:
# ham apply()
df. item_price = df.item_price.apply(lambda x : float(x.replace("$", "")))

In [70]:
df.head()

,order_id,quantity,item_name,choice_description,item_price
0,1,1,Chips and Fresh Tomato Salsa,NaN,2.39
1,1,1,Izze,[Clementine],3.39
2,1,1,Nantucket Nectar,[Apple],3.39
3,1,1,Chips and Tomatillo-Green Chili Salsa,NaN,2.39
4,2,2,Chicken Bowl,"[Tomatillo-Red Chili Salsa (Hot), [Black Beans...",16.98

In [85]:
df.total_price = df.quantity * df.item_price

In [86]:
df.head(6)

,order_id,quantity,item_name,choice_description,item_price,total_price
0,1,1,Chips and Fresh Tomato Salsa,NaN,2.39,2.39
1,1,1,Izze,[Clementine],3.39,3.39
2,1,1,Nantucket Nectar,[Apple],3.39,3.39
3,1,1,Chips and Tomatillo-Green Chili Salsa,NaN,2.39,2.39
4,2,2,Chicken Bowl,"[Tomatillo-Red Chili Salsa (Hot), [Black Beans...",16.98,33.96
5,3,1,Chicken Bowl,"[Fresh Tomato Salsa (Mild), [Rice, Cheese, Sou...",10.98,10.98

#### how much was the revenue for the period in the data set ?

In [89]:
revenue = df.total_price.sum()
print(revenue)

39237.02

#### Which was the most-ordered item ?

In [99]:
# group by 
a = df.groupby("item_name")["quantity"].sum()
a.sort_values(ascending = False ).head(5)

item_name
Chicken Bowl           761
Chicken Burrito        591
Chips and Guacamole    506
Steak Burrito          386
Canned Soft Drink      351
Name: quantity, dtype: int64

In [101]:
#unique Value
df.item_name.value_counts().count()

np.int64(50)

In [103]:
#nuique 
df.item_name.nunique()

50

In [105]:
df.item_name.unique()

array(['Chips and Fresh Tomato Salsa', 'Izze', 'Nantucket Nectar',
       'Chips and Tomatillo-Green Chili Salsa', 'Chicken Bowl',
       'Side of Chips', 'Steak Burrito', 'Steak Soft Tacos',
       'Chips and Guacamole', 'Chicken Crispy Tacos',
       'Chicken Soft Tacos', 'Chicken Burrito', 'Canned Soda',
       'Barbacoa Burrito', 'Carnitas Burrito', 'Carnitas Bowl',
       'Bottled Water', 'Chips and Tomatillo Green Chili Salsa',
       'Barbacoa Bowl', 'Chips', 'Chicken Salad Bowl', 'Steak Bowl',
       'Barbacoa Soft Tacos', 'Veggie Burrito', 'Veggie Bowl',
       'Steak Crispy Tacos', 'Chips and Tomatillo Red Chili Salsa',
       'Barbacoa Crispy Tacos', 'Veggie Salad Bowl',
       'Chips and Roasted Chili-Corn Salsa',
       'Chips and Roasted Chili Corn Salsa', 'Carnitas Soft Tacos',
       'Chicken Salad', 'Canned Soft Drink', 'Steak Salad Bowl',
       '6 Pack Soft Drink', 'Chips and Tomatillo-Red Chili Salsa', 'Bowl',
       'Burrito', 'Crispy Tacos', 'Carnitas Crispy Tacos', 'Steak Salad',
       'Chips and Mild Fresh Tomato Salsa', 'Veggie Soft Tacos',
       'Carnitas Salad Bowl', 'Barbacoa Salad Bowl', 'Salad',
       'Veggie Crispy Tacos', 'Veggie Salad', 'Carnitas Salad'],
      dtype=object)